_posts/2015-01-01-risk-probabilities.html
---
date: 2015-01-01
tags: 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- dummy-tags-should-be-replaced
author: 
layout: post
title: Risk (board game) Probabilities
excerpt: I compute the probability of victory in a Risk battle.
categories: 
- julia
- probability
- games
featured: false
---

<div id="outline-container-org0481574" class="outline-2">
<h2 id="org0481574">Setup</h2>
<div class="outline-text-2" id="text-org0481574">
<p>
I was playing Risk over the holidays and it occurred to me that I can
calculate my odds of victory when attacking a territory. Sad to say,
it didn't help me win, but it provided me the excuse to do some fun
calculations on my graph paper while waiting for my next turn.
</p>
</div>

<div id="outline-container-org2e7a43e" class="outline-3">
<h3 id="org2e7a43e">A quick review of the rules</h3>
<div class="outline-text-3" id="text-org2e7a43e">
<p>
Battles in risk are resolved as follows :
</p>

<ol class="org-ol">
<li>The attacker chooses up to max(number of attacking armies, 3) dice to roll.</li>
<li>The defender chooses up to max(number of defending armies, 2) dice to roll.</li>
<li>The attacker and defender roll all of their dice simultaneously.</li>
<li>The attacker and defender compare their highest rolls. Whichever
is higher wins and the loser loses an army. Ties go to the
defender.</li>
<li>If both attacker and defender rolled at least 2 dice, they
compare the next highest roll with the same process as 4.</li>
<li>If there are no attacking armies left, the defender wins. If
there are no defending armies left, the attacker wins and claims
the territory. Else return to 1</li>
</ol>

<p>
So if the attacker rolls a 5, 3, and 2 while the defender rolls a 5
and 2 then both the attacker and defender lose one army.
</p>
</div>
</div>
<div id="outline-container-org661f5f7" class="outline-3">
<h3 id="org661f5f7">Some Simplifications</h3>
<div class="outline-text-3" id="text-org661f5f7">
<p>
I'm going to assume that everyone always rolls as many dice as
possible. This is reasonable; rolling as many dice as possible
seems to be the optimal strategy, but I haven't tried proving this.
</p>

<p>
I'm also assuming that the attacker cannot stop halfway through a
battle. This is not reasonable; indeed the ability to make this
decision is part of what keeps the game interesting. However, to
incorporate this effect into our calculations requires us to model
this decision-making process. I decided to sidestep this
complexity.
</p>
</div>
</div>
</div>

<div id="outline-container-org0e1f98a" class="outline-2">
<h2 id="org0e1f98a">Solution using Markov Chains</h2>
<div class="outline-text-2" id="text-org0e1f98a">
<p>
A Markov chain is the first approach that came to my mind as I've
done similar calculations for games like Monopoly and Chutes and
Ladders. Somebody else thought of it too; when doing a little
research for this post I found this <a href="http://www4.stat.ncsu.edu/~jaosborn/research/RISK.pdf">paper</a>.
</p>

<p>
The idea is that a battle is a Markov chain with states \[ \{(A,D) :
  A \in \mathbb{Z}, D \in \mathbb{Z} \}\] which represent the number of
armies of the attacker and defender respectively. While both
attacker and defender have armies the chain progresses through the
states until it eventually hits an absorbing state \((A, 0)\) in which
case the attacker wins, or \((0, D)\) in which case the defender wins
the battle.
</p>

<p>
All we have to do is create the transition matrix, initialize our
starting state, and then calculate the stationary distribution of
the chain with the power method. If you're terribly interested in
the details, check out the linked paper.
</p>

<p>
I think this is the wrong approach. While a Markov chain approach is
certainly a correct way to proceed, it's conceptually convoluted and
cumbersome to compute both on paper and with code. It also doesn't
scale very well: your number of states is \(A \times D\) and your
transition matrix grows by the square of the number of
states <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. You might be able to organize the transition matrix
in such a way that it's easy to take powers analytically, but I'm
skeptical.
</p>
</div>
</div>

<div id="outline-container-org896c6a3" class="outline-2">
<h2 id="org896c6a3">Solution by Recursion</h2>
<div class="outline-text-2" id="text-org896c6a3">
<p>
Here's a simpler approach.
</p>

<p>
First let's denote \(p_{A, D}\) to be the probability that the attacker
will win a battle starting with \(A\) armies when the defender has \(D\)
armies.
</p>

<p>
Let's just use the following recursion.
</p>

<p>
\[ p(A, D) = \sum_{l=0}^{A} t(l, \min(A, 3), \min(D, 2)) \times p(A - l, D - (n - l)) \]
</p>

<p>
where \(t(l, a, d)\) is the probability that the attacker will lose
\(l\) armies when rolling \(a\) dice and the defender is rolling \(d\)
dice. Calculating these probabilities is a a simple exercise, so
I'll omit the calculations <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. 
</p>

<p>
We also have the base conditions. If the defender has no armies then
it's a sure win for the attacker, thus
</p>

<p>
\[ p(A, 0) = 1 \] 
</p>

<p>
Likewise if the attacker has no armies then it's a sure loss.
</p>

<p>
\[ p(0, D) = 0 \]
</p>

<p>
An astute reader will notice that this is the exact same setup as a
Markov chain, however we don't need to rely upon the power method
here. Instead we can just keep applying the recursion until we hit an
absorbing state.
</p>
</div>
</div>

<div id="outline-container-org5c4c5b7" class="outline-2">
<h2 id="org5c4c5b7">Julia Implementation</h2>
<div class="outline-text-2" id="text-org5c4c5b7">
<p>
Julia code implementing the recursion can be found in this <a href="https://gist.github.com/minimallysufficient/96a45cd32d642cb820e4">gist</a>.
</p>

<p>
The naive approach of writing a top-down recursive function will
take a long time to execute even for modestly sized armies. The
reason is that we're performing a large amount of duplicate work by
following every potential path down the recursion. To avoid this
duplication we should build up a table of results from the bottom
up, starting with the base cases.
</p>
</div>
</div>

<div id="outline-container-org8821bdd" class="outline-2">
<h2 id="org8821bdd">Exercises for the Reader</h2>
<div class="outline-text-2" id="text-org8821bdd">
</div>
<div id="outline-container-orge116628" class="outline-3">
<h3 id="orge116628">Expected Value</h3>
<div class="outline-text-3" id="text-orge116628">
<p>
Instead of the probability that the attacker will win, it would be
very helpful to know the expected number of armies the attacker
will retain at the end of the battle.
</p>

<p>
How can the recursion be altered to allow for the computation of
this expectation?
</p>
</div>
</div>

<div id="outline-container-org54f554c" class="outline-3">
<h3 id="org54f554c">Distribution</h3>
<div class="outline-text-3" id="text-org54f554c">
<p>
We might instead be interested in the distribution of \(F_{A, D}\), the
number of armies that the attacker will have at the end of the
battle starting with \(A\) attacking armies and \(D\) defending armies.
Notice that we can express the probability that the attacker wins
as \(\Pr(F_{A, D} > 0)\) and the expected number of armies the attacker will
retain as \(E[F_{A, D}]\).
</p>

<p>
How can the recursion be altered to allow for the computation of
this distribution?
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
If you are only calculating battles which could conceivably
occur in a normal Risk game, you should be fine. If you want to know
how a 1000 vs 1000 battle will turn out, you'll need another approach.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
I've thought about it for a while and I'm not sure that there
are much better approaches than brute-force enumeration. This works
well for rolling up to 3 dice, but it quickly becomes
computationally infeasible for more dice. This might be a good excuse
for expanding my combinatorics knowledge.
</p></div></div>


</div>
</div>
